driver-tests/bpelse/repeatuntil/RepeatuntilJbi/test/RepeatUntilAssignTest6/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rep="http://localhost/RepeatUntilBPEL/RepeatUntilAssign">
  <soapenv:Body>
    <rep:string>TestRptAssign</rep:string>
    <rep:int>2</rep:int>
    <rep:bool>false</rep:bool>
    <rep:duration>P7M6DT12H49M48S</rep:duration>
    <rep:negInt>-200</rep:negInt>
    <rep:double>1.051732E7</rep:double>
  </soapenv:Body>
</soapenv:Envelope>